# Задача 2 - Функция hi(): приветствие пользователя

def hi(name):
    """Выводит приветствие по имени."""
    print(f"Привет, {name}!")


# Пример использования:
user_name = input("Введите ваше имя: ")
hi(user_name)
